## **[MySQL WHERE](https://www.mysqltutorial.org/mysql-where/)**

Use the MySQL WHERE clause in the SELECT statement to filter rows from the result set.

In [1]:
import pandas as pd
import numpy as np
import re
import matplotlib.pyplot as plt
import matplotlib.image as mpimg
from IPython.display import Image, SVG

from sqlalchemy_utils import database_exists, create_database
from sqlalchemy import create_engine, inspect, MetaData, text
from sqlalchemy_schemadisplay import create_schema_graph
import pymysql

pd.set_option(
    'display.max_columns', None,
    'expand_frame_repr', True,
    # 'max_rows', 10, 
    'display.max_colwidth', None,
    'display.max_rows', 10,
    # 'precision', 2,
    # 'width', 45
)

pd.set_option('display.width', 65)

In [2]:
connect_args={'ssl':{'fake_flag_to_enable_tls': True}}

engine = create_engine('mysql+pymysql://namlq:abc123@localhost/classicmodels',
                       connect_args=connect_args, echo=False
                         )
inspector = inspect(engine)

### Introduction to MySQL WHERE clause

syntax:

SELECT 
    select_list
FROM
    table_name
WHERE
    search_condition;

In [3]:
SVG('../images/MySQL-Where.svg')

### MySQL WHERE clause examples

#### 1) Using MySQL Where clause with equality operator

In [4]:
# 2.02 ms ± 182 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
# %%timeit
string = '''
SELECT
    lastName, firstName, jobTitle
FROM employees
WHERE jobtitle = 'Sales Rep';
'''

df1 = pd.read_sql(string, engine)

In [5]:
# 35.1 ms ± 1.69 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
# %%timeit
df2 = (pd
 .read_sql_table('employees', engine)
 .query("jobTitle == 'Sales Rep'")
 [['lastName', 'firstName', 'jobTitle']]
 .reset_index(drop=True)
)

In [6]:
df1.equals(df2)

True

In [7]:
df1.head()

    lastName firstName   jobTitle
0   Jennings    Leslie  Sales Rep
1   Thompson    Leslie  Sales Rep
2   Firrelli     Julie  Sales Rep
3  Patterson     Steve  Sales Rep
4      Tseng  Foon Yue  Sales Rep

#### 2) Using MySQL WHERE clause with the AND operator

In [8]:
# %%timeit
# 2.05 ms ± 195 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
string = '''
SELECT
    lastName, firstName, jobTitle, officeCode
FROM employees
WHERE
    jobtitle = 'Sales Rep' AND
    officeCode = 1;
'''

pd.read_sql(string, engine)

   lastName firstName   jobTitle officeCode
0  Jennings    Leslie  Sales Rep          1
1  Thompson    Leslie  Sales Rep          1

In [9]:
# %%timeit
# 35.8 ms ± 2.58 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
(pd
 .read_sql_table('employees', engine)
 .query("jobTitle == 'Sales Rep' and officeCode == '1'")
 [['lastName', 'firstName', 'jobTitle', 'officeCode']]
 .reset_index(drop=True)
)

   lastName firstName   jobTitle officeCode
0  Jennings    Leslie  Sales Rep          1
1  Thompson    Leslie  Sales Rep          1

#### 3) Using MySQL WHERE clause with OR operator

In [10]:
# %%timeit
# 2.24 ms ± 78.9 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)
string = '''
SELECT
    lastName, firstName, jobTitle, officeCode
FROM
    employees
WHERE
    jobtitle = 'Sales Rep' OR officeCode = 1
ORDER BY
    officeCode, jobTitle, firstName;
'''

df1 = pd.read_sql(string, engine)

In [11]:
# %%timeit
# 36.8 ms ± 1.61 ms per loop (mean ± std. dev. of 7 runs, 10 loops each)
df2 = (pd
 .read_sql_table('employees', engine)
 .query("jobTitle == 'Sales Rep' or officeCode == '1'")
 [['lastName', 'firstName', 'jobTitle', 'officeCode']]
 .sort_values(by=['officeCode', 'jobTitle', 'firstName'],
              ignore_index=True)
)

In [12]:
df1.equals(df2)

True

In [13]:
df1.head()

   lastName firstName            jobTitle officeCode
0    Murphy     Diane           President          1
1       Bow   Anthony  Sales Manager (NA)          1
2  Jennings    Leslie           Sales Rep          1
3  Thompson    Leslie           Sales Rep          1
4  Firrelli      Jeff        VP Marketing          1

#### 4) Using MySQL WHERE clause with the BETWEEN operator

In [14]:
string = '''
SELECT
    firstName, lastName, officeCode
FROM employees
WHERE officeCode BETWEEN 1 AND 3
ORDER BY officeCode, firstName;
'''

df1 = pd.read_sql(string, engine)

In [15]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query("officeCode.isin(['1', '2', '3'])")
    [['firstName', 'lastName', 'officeCode']]
    .sort_values(by=['officeCode', 'firstName'],
                 ignore_index=True)
)

In [16]:
df1.equals(df2)

True

In [17]:
df1.head()

  firstName  lastName officeCode
0   Anthony       Bow          1
1     Diane    Murphy          1
2      Jeff  Firrelli          1
3    Leslie  Jennings          1
4    Leslie  Thompson          1

#### 5) Using MySQL WHERE clause with the LIKE operator

In [18]:
# The `_` wildcard matches any single character
string = '''
SELECT firstName, lastName
FROM employees
WHERE lastName LIKE "_atterson"
ORDER BY firstName;
'''

pd.read_sql(string, engine)

  firstName   lastName
0      Mary  Patterson
1     Steve  Patterson
2   William  Patterson

In [19]:
(pd.read_sql_table('employees', engine)
 .query("lastName.str.contains('^.atterson')")
 [['firstName', 'lastName']]
 .sort_values('firstName', ignore_index=True)
)

  firstName   lastName
0      Mary  Patterson
1     Steve  Patterson
2   William  Patterson

In [20]:
# The `%` wildcard matches any string of zero or more characters
# The `%` wildcard works on mysql console
# Must use `sqlalchemy.text` inorder `%` to work
string = '''
SELECT firstName, lastName
FROM employees
WHERE lastName LIKE "%son"
ORDER BY firstName;
'''

pd.read_sql(text(string), engine)

  firstName   lastName
0    Leslie   Thompson
1      Mary  Patterson
2     Steve  Patterson
3   William  Patterson

In [21]:
(pd.read_sql_table('employees', engine)
 .query("lastName.str.endswith('son')")
 [['firstName', 'lastName']]
 .sort_values('firstName', ignore_index=True)
)

  firstName   lastName
0    Leslie   Thompson
1      Mary  Patterson
2     Steve  Patterson
3   William  Patterson

#### 6) Using MySQL WHERE clause with the IN operator

In [22]:
string = '''
SELECT firstName, lastName, officeCode
FROM employees
WHERE officeCode IN (2, 4)
ORDER BY officeCode, firstName;
'''

df1 = pd.read_sql(string, engine)

In [23]:
df2 = (
    pd.read_sql_table('employees', engine)
    .query("officeCode.isin(['2', '4'])")
    [['firstName', 'lastName', 'officeCode']]
    .sort_values(by=['officeCode', 'firstName'],
                 ignore_index=True)
)

In [24]:
df1.equals(df2)

True

In [25]:
df1

  firstName   lastName officeCode
0     Julie   Firrelli          2
1     Steve  Patterson          2
2    Gerard     Bondur          4
3    Gerard  Hernandez          4
4      Loui     Bondur          4
5    Martin     Gerard          4
6    Pamela   Castillo          4

#### 7) Using MySQL WHERE clause with the IS NULL operator

In [26]:
string = '''
SELECT lastName, firstName, reportsTo
FROM employees
WHERE reportsTo IS NULL;
'''

pd.read_sql(string, engine)

  lastName firstName reportsTo
0   Murphy     Diane      None

In [27]:
(pd.read_sql_table('employees', engine)
 .query("reportsTo.isna()")
 [['lastName', 'firstName', 'reportsTo']]
)

  lastName firstName  reportsTo
0   Murphy     Diane        NaN

#### 8) Using MySQL WHERE clause with the comparison operators

- `=`: Equal to. You can use it with almost any data type.
- `<>` or `!=`: Not equal to.
- `<`: Less than. You typically use it with numeric and date/time data types.
- `>`: Greater than.
- `<=`: Less than or equal to.
- `>=`: Greater than or equal to.

In [28]:
string = '''
SELECT lastName, firstName, jobTitle
FROM employees
WHERE jobTitle <> 'Sales Rep';
'''

pd.read_sql(string, engine)

    lastName firstName              jobTitle
0     Murphy     Diane             President
1  Patterson      Mary              VP Sales
2   Firrelli      Jeff          VP Marketing
3  Patterson   William  Sales Manager (APAC)
4     Bondur    Gerard   Sale Manager (EMEA)
5        Bow   Anthony    Sales Manager (NA)

In [29]:
(pd.read_sql_table('employees', engine)
 .query("jobTitle != 'Sales Rep'")
 [['lastName', 'firstName', 'jobTitle']]
)

    lastName firstName              jobTitle
0     Murphy     Diane             President
1  Patterson      Mary              VP Sales
2   Firrelli      Jeff          VP Marketing
3  Patterson   William  Sales Manager (APAC)
4     Bondur    Gerard   Sale Manager (EMEA)
5        Bow   Anthony    Sales Manager (NA)